 # What is Pandas?
python library for data manipulation and analysis

설치 : **pip install pandas**

# Library Highlights
* A fast and efficient **DataFrame** object for data manipulation with integrated indexing;

* Tools for **reading and writing data** between in-memory data structures and different formats: CSV and text files, Microsoft Excel, SQL databases, and the fast HDF5 format;

* Intelligent **data alignment** and integrated handling of **missing data**: gain automatic label-based alignment in computations and easily manipulate messy data into an orderly form;

* Flexible **reshaping** and pivoting of data sets;

* Intelligent label-based **slicing, fancy indexing,** and **subsetting** of large data sets;

* Columns can be inserted and deleted from data structures for **size mutability**;

* Aggregating or transforming data with a powerful **group by** engine allowing split-apply-combine operations on data sets;

* High performance **merging and joining** of data sets;

* **Hierarchical axis indexing** provides an intuitive way of working with high-dimensional data in a lower-dimensional data structure;

* **Time series**-functionality: date range generation and frequency conversion, moving window statistics, date shifting and lagging. Even create domain-specific time offsets and join time series without losing data;

* Highly **optimized for performance**, with critical code paths written in Cython or C.

* Python with pandas is in use in a wide variety of **academic and commercial** domains, including Finance, Neuroscience, Economics, Statistics, Advertising, Web Analytics, and more.

In [3]:
import pandas as pd

df = pd.read_csv(r"C:\Temp\Data_set.csv", encoding='euc-kr')
df

,CUST_ID,TARGET,BNK_LNIF_CNT,CPT_LNIF_CNT,SPART_LNIF_CNT,ECT_LNIF_CNT,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,...,CBPT_MBSP_YN,MOBL_FATY_PRC,TEL_CNTT_QTR,NUM_DAY_SUSP,CRMM_OVDU_AMT,TLFE_UNPD_CNT,LT1Y_MXOD_AMT,PAYM_METD,LINE_STUS,MOBL_PRIN
0,1,0,1,0,0,0,9001,9001,9001,0,...,N,800000,20111,0,0,0,0,O,U,580000
1,2,0,1,0,0,0,24001,0,24001,0,...,N,500000,20143,0,0,0,0,O,U,90000
2,3,0,0,1,3,2,15001,9001,0,3001,...,Y,500000,20103,0,0,0,0,O,U,120000
3,4,1,0,2,4,2,6001,3001,0,3001,...,N,900000,20144,0,540000,0,630000,G,S,320000
4,5,0,4,0,0,0,21001,15001,21001,0,...,Y,800000,20131,0,130000,0,90000,G,U,410000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
100228,102248,0,1,0,2,2,75001,15001,57001,0,...,N,0,20111,0,20000,0,0,R,U,0
100229,102249,0,2,0,0,0,54001,9001,54001,0,...,Y,900000,20134,0,0,0,0,K,U,180000
100230,102250,0,1,0,0,0,27001,27001,27001,0,...,N,0,20141,0,0,0,0,O,U,0
100231,102251,0,0,0,1,1,57001,0,0,0,...,N,900000,20103,0,0,0,0,O,U,540000
100232,102252,0,1,0,0,0,18001,18001,18001,0,...,N,400000,20151,0,0,0,60000,K,U,180000

# What is DataFrame?
dataframe is a 2-dimensional labeled data structure with columns

In [13]:
df.head()

,CUST_ID,TARGET,BNK_LNIF_CNT,CPT_LNIF_CNT,SPART_LNIF_CNT,ECT_LNIF_CNT,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,...,CBPT_MBSP_YN,MOBL_FATY_PRC,TEL_CNTT_QTR,NUM_DAY_SUSP,CRMM_OVDU_AMT,TLFE_UNPD_CNT,LT1Y_MXOD_AMT,PAYM_METD,LINE_STUS,MOBL_PRIN
0,1,0,1,0,0,0,9001,9001,9001,0,...,N,800000,20111,0,0,0,0,O,U,580000
1,2,0,1,0,0,0,24001,0,24001,0,...,N,500000,20143,0,0,0,0,O,U,90000
2,3,0,0,1,3,2,15001,9001,0,3001,...,Y,500000,20103,0,0,0,0,O,U,120000
3,4,1,0,2,4,2,6001,3001,0,3001,...,N,900000,20144,0,540000,0,630000,G,S,320000
4,5,0,4,0,0,0,21001,15001,21001,0,...,Y,800000,20131,0,130000,0,90000,G,U,410000

# What is Series?
Every single column in dataframe is series

In [19]:
df["TOT_LNIF_AMT"]

0          9001
1         24001
2         15001
3          6001
4         21001
          ...
100228    75001
100229    54001
100230    27001
100231    57001
100232    18001
Name: TOT_LNIF_AMT, Length: 100233, dtype: int64

In [7]:
df.CBPT_MBSP_YN = df.CBPT_MBSP_YN.str.lower()
df.head()

,CUST_ID,TARGET,BNK_LNIF_CNT,CPT_LNIF_CNT,SPART_LNIF_CNT,ECT_LNIF_CNT,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,...,CBPT_MBSP_YN,MOBL_FATY_PRC,TEL_CNTT_QTR,NUM_DAY_SUSP,CRMM_OVDU_AMT,TLFE_UNPD_CNT,LT1Y_MXOD_AMT,PAYM_METD,LINE_STUS,MOBL_PRIN
0,1,0,1,0,0,0,9001,9001,9001,0,...,n,800000,20111,0,0,0,0,O,U,580000
1,2,0,1,0,0,0,24001,0,24001,0,...,n,500000,20143,0,0,0,0,O,U,90000
2,3,0,0,1,3,2,15001,9001,0,3001,...,y,500000,20103,0,0,0,0,O,U,120000
3,4,1,0,2,4,2,6001,3001,0,3001,...,n,900000,20144,0,540000,0,630000,G,S,320000
4,5,0,4,0,0,0,21001,15001,21001,0,...,y,800000,20131,0,130000,0,90000,G,U,410000

# Why Pandas?

Very similar to **Excel spreadsheet** view,  
support various functions for data manipulation and analysis.  
Fast based on Numpy.
Easy to manipulate data for your purpose

# Read Data 

* pd.read_csv('data/friend_list.csv') <br>
  Read a comma-separated values (csv) file into DataFrame.

* pd.read_excel(filename) <br>
  Supports xls, xlsx, xlsm, xlsb, odf, ods and odt file extensions read from a local filesystem or URL. 

* pd.read_sas(fileame) <br>
  Read SAS files stored as either XPORT or SAS7BDAT format files.

* pandas.read_sql(sql, conn) <br>
  Read SQL database table into a DataFrame

  외에도 다양한 데이터를 읽어오는 방법 제공

# Create DataFrame
when you want to create dataframe from your python code

In [20]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df1 = pd.DataFrame(friend_dict_list)
df1

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

if you need fixed column order, you can adjust column order like below,

In [25]:
df1 = df1[ ['name', 'job']]
df1

    name        job
1  Jenny  developer

## from list

In [53]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
column_name = ['name', 'age', 'job']
df1 = pd.DataFrame.from_records(friend_list, columns=column_name)
df1

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# Write DataFrame to File

In [20]:
df.to_csv(r'c:\temp\loan.csv')

In [5]:
#pip install xlsxwriter
#but slow

df.to_excel(r'c:\temp\loan.xlsx', engine='xlsxwriter')

# select rows

In [27]:
# select rows from index 1 to index 2

df[100:200]

,CUST_ID,TARGET,BNK_LNIF_CNT,CPT_LNIF_CNT,SPART_LNIF_CNT,ECT_LNIF_CNT,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,...,CBPT_MBSP_YN,MOBL_FATY_PRC,TEL_CNTT_QTR,NUM_DAY_SUSP,CRMM_OVDU_AMT,TLFE_UNPD_CNT,LT1Y_MXOD_AMT,PAYM_METD,LINE_STUS,MOBL_PRIN
100,102,0,2,0,0,0,66001,66001,66001,0,...,N,0,20131,4,0,0,0,K,U,40000
101,103,0,1,1,1,0,30001,0,27001,3001,...,Y,300000,20123,0,50000,2,50000,O,U,0
102,104,0,1,0,0,0,87001,0,87001,0,...,N,900000,20124,0,0,0,0,O,U,410000
103,105,0,2,2,2,0,66001,12001,42001,24001,...,Y,0,20134,46,0,0,0,K,U,0
104,106,0,1,0,0,0,1,1,1,0,...,Y,700000,20143,0,0,0,0,O,U,330000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,198,0,1,0,0,0,33001,0,33001,0,...,Y,600000,20143,0,0,0,0,O,U,220000
196,199,1,1,2,2,0,18001,9001,9001,6001,...,N,0,20132,0,0,0,0,K,U,200000
197,200,0,1,0,0,0,15001,0,15001,0,...,Y,1000000,20141,0,0,0,0,O,U,130000
198,201,0,0,2,4,2,36001,27001,0,18001,...,N,900000,20094,0,0,0,0,K,U,780000
199,202,0,3,0,0,0,468001,45001,468001,0,...,N,0,20134,0,0,0,0,NaN,U,130000

In [30]:
df[0:10:2]

,CUST_ID,TARGET,BNK_LNIF_CNT,CPT_LNIF_CNT,SPART_LNIF_CNT,ECT_LNIF_CNT,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,...,CBPT_MBSP_YN,MOBL_FATY_PRC,TEL_CNTT_QTR,NUM_DAY_SUSP,CRMM_OVDU_AMT,TLFE_UNPD_CNT,LT1Y_MXOD_AMT,PAYM_METD,LINE_STUS,MOBL_PRIN
0,1,0,1,0,0,0,9001,9001,9001,0,...,N,800000,20111,0,0,0,0,O,U,580000
2,3,0,0,1,3,2,15001,9001,0,3001,...,Y,500000,20103,0,0,0,0,O,U,120000
4,5,0,4,0,0,0,21001,15001,21001,0,...,Y,800000,20131,0,130000,0,90000,G,U,410000
6,7,0,0,1,2,1,12001,3001,0,9001,...,N,900000,20143,0,120000,0,290000,G,U,720000
8,9,0,2,0,0,0,273001,273001,273001,0,...,Y,0,20131,0,0,0,0,O,U,0

In [9]:
# select row index 0 and index 50 and 100

df.loc[[0,50,100]]

,CUST_ID,TARGET,BNK_LNIF_CNT,CPT_LNIF_CNT,SPART_LNIF_CNT,ECT_LNIF_CNT,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,...,CBPT_MBSP_YN,MOBL_FATY_PRC,TEL_CNTT_QTR,NUM_DAY_SUSP,CRMM_OVDU_AMT,TLFE_UNPD_CNT,LT1Y_MXOD_AMT,PAYM_METD,LINE_STUS,MOBL_PRIN
0,1,0,1,0,0,0,9001,9001,9001,0,...,N,800000,20111,0,0,0,0,O,U,580000
50,51,0,1,0,1,1,84001,9001,75001,0,...,N,900000,19993,0,0,0,0,G,U,0
100,102,0,2,0,0,0,66001,66001,66001,0,...,N,0,20131,4,0,0,0,K,U,40000

In [32]:
# by column condition

df_filtered = df[df.TARGET == 1]
df_filtered.head()

,CUST_ID,TARGET,BNK_LNIF_CNT,CPT_LNIF_CNT,SPART_LNIF_CNT,ECT_LNIF_CNT,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,...,CBPT_MBSP_YN,MOBL_FATY_PRC,TEL_CNTT_QTR,NUM_DAY_SUSP,CRMM_OVDU_AMT,TLFE_UNPD_CNT,LT1Y_MXOD_AMT,PAYM_METD,LINE_STUS,MOBL_PRIN
3,4,1,0,2,4,2,6001,3001,0,3001,...,N,900000,20144,0,540000,0,630000,G,S,320000
10,11,1,0,3,5,2,27001,27001,0,18001,...,N,900000,20062,0,0,0,0,R,U,470000
36,37,1,0,1,2,1,3001,3001,0,1,...,N,900000,20123,0,120000,0,490000,G,U,460000
46,47,1,0,1,2,1,3001,3001,0,1,...,N,0,20132,0,50000,0,0,O,U,0
75,76,1,0,1,2,1,1,1,0,1,...,N,0,20102,8,0,0,0,G,U,110000

In [34]:
df_filtered = df.query('TOT_LNIF_AMT>20000')
df_filtered.head()

,CUST_ID,TARGET,BNK_LNIF_CNT,CPT_LNIF_CNT,SPART_LNIF_CNT,ECT_LNIF_CNT,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,...,CBPT_MBSP_YN,MOBL_FATY_PRC,TEL_CNTT_QTR,NUM_DAY_SUSP,CRMM_OVDU_AMT,TLFE_UNPD_CNT,LT1Y_MXOD_AMT,PAYM_METD,LINE_STUS,MOBL_PRIN
1,2,0,1,0,0,0,24001,0,24001,0,...,N,500000,20143,0,0,0,0,O,U,90000
4,5,0,4,0,0,0,21001,15001,21001,0,...,Y,800000,20131,0,130000,0,90000,G,U,410000
5,6,0,1,0,1,1,141001,27001,111001,0,...,N,400000,20154,0,0,0,0,O,U,170000
8,9,0,2,0,0,0,273001,273001,273001,0,...,Y,0,20131,0,0,0,0,O,U,0
10,11,1,0,3,5,2,27001,27001,0,18001,...,N,900000,20062,0,0,0,0,R,U,470000

In [46]:
df_filtered = df[(df.TOT_LNIF_AMT > 200000) & (df.TARGET == 1)]
#df_filtered = df.query('TOT_LNIF_AMT>20000 & TARGET == 1')
df_filtered

,CUST_ID,TARGET,BNK_LNIF_CNT,CPT_LNIF_CNT,SPART_LNIF_CNT,ECT_LNIF_CNT,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,...,CBPT_MBSP_YN,MOBL_FATY_PRC,TEL_CNTT_QTR,NUM_DAY_SUSP,CRMM_OVDU_AMT,TLFE_UNPD_CNT,LT1Y_MXOD_AMT,PAYM_METD,LINE_STUS,MOBL_PRIN
521,529,1,3,0,1,1,219001,180001,198001,0,...,N,300000,20153,0,0,0,50000,O,U,210000
721,732,1,0,0,1,1,994001,994001,0,0,...,N,500000,20143,0,350000,0,370000,G,U,60000
1132,1156,1,1,4,4,0,204001,186001,186001,18001,...,N,0,20151,0,0,0,140000,O,U,0
1726,1763,1,0,0,3,3,804001,63001,0,0,...,N,0,20154,0,0,0,0,O,U,0
1761,1798,1,0,1,2,1,222001,0,0,1,...,N,0,20022,0,0,0,0,NaN,U,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99342,101350,1,0,5,7,3,204001,24001,0,21001,...,N,300000,20144,0,80000,0,80000,G,S,60000
99586,101595,1,1,0,0,0,204001,0,204001,0,...,N,0,20112,0,0,0,0,O,U,0
99937,101952,1,5,2,3,1,246001,75001,75001,9001,...,Y,1000000,19982,22,0,0,270000,O,U,0
100069,102085,1,0,1,2,1,306001,0,0,1,...,N,0,20114,0,0,0,0,O,U,0
100096,102112,1,0,0,2,2,684001,684001,0,0,...,N,0,20133,0,270000,0,0,G,U,110000

# Filter Column

by index

In [20]:
#df.iloc[row선택, column선택]
df.iloc[:, 0:2]

        CUST_ID  TARGET
0             1       0
1             2       0
2             3       0
3             4       1
4             5       0
...         ...     ...
100228   102248       0
100229   102249       0
100230   102250       0
100231   102251       0
100232   102252       0

[100233 rows x 2 columns]

In [22]:
df.iloc[:,[0,5]]

        CUST_ID  ECT_LNIF_CNT
0             1             0
1             2             0
2             3             2
3             4             2
4             5             0
...         ...           ...
100228   102248             2
100229   102249             0
100230   102250             0
100231   102251             1
100232   102252             0

[100233 rows x 2 columns]

by column name

In [24]:
df_filtered = df[['CUST_ID', 'TOT_LNIF_AMT']]
df_filtered

        CUST_ID  TOT_LNIF_AMT
0             1          9001
1             2         24001
2             3         15001
3             4          6001
4             5         21001
...         ...           ...
100228   102248         75001
100229   102249         54001
100230   102250         27001
100231   102251         57001
100232   102252         18001

[100233 rows x 2 columns]

In [25]:
df.filter(items=['CUST_ID', 'TOT_LNIF_AMT'])

        CUST_ID  TOT_LNIF_AMT
0             1          9001
1             2         24001
2             3         15001
3             4          6001
4             5         21001
...         ...           ...
100228   102248         75001
100229   102249         54001
100230   102250         27001
100231   102251         57001
100232   102252         18001

[100233 rows x 2 columns]

In [32]:
df.filter(like='AMT',axis=1)

,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,CB_GUIF_AMT,TOT_CRLN_AMT,TOT_REPY_AMT,STLN_REMN_AMT,LT1Y_STLN_AMT,CNTT_LAMT_CNT,FYCM_PAID_AMT,MON_TLFE_AMT,CRMM_OVDU_AMT,LT1Y_MXOD_AMT
0,9001,9001,9001,0,420001,0,0,0,0,0,0,80000,0,0
1,24001,0,24001,0,0,0,0,0,0,0,300000,40000,0,0
2,15001,9001,0,3001,0,0,0,0,0,0,0,40000,0,0
3,6001,3001,0,3001,0,0,0,0,0,0,0,80000,540000,630000
4,21001,15001,21001,0,0,0,0,2000000,0,0,500000,80000,130000,90000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
100228,75001,15001,57001,0,0,0,0,0,0,0,700000,20000,20000,0
100229,54001,9001,54001,0,0,0,0,0,0,0,100000,80000,0,0
100230,27001,27001,27001,0,0,0,0,0,0,0,0,20000,0,0
100231,57001,0,0,0,0,0,0,0,0,0,0,180000,0,0
100232,18001,18001,18001,0,0,0,0,0,0,0,2900000,40000,0,60000

In [37]:
# 정규식 .. 몰라도 됨 (알면 좋은데 너무 어려움)
df.filter(regex='T$',axis=1)
df

,CUST_ID,TARGET,BNK_LNIF_CNT,CPT_LNIF_CNT,SPART_LNIF_CNT,ECT_LNIF_CNT,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,...,CBPT_MBSP_YN,MOBL_FATY_PRC,TEL_CNTT_QTR,NUM_DAY_SUSP,CRMM_OVDU_AMT,TLFE_UNPD_CNT,LT1Y_MXOD_AMT,PAYM_METD,LINE_STUS,MOBL_PRIN
0,1,0,1,0,0,0,9001,9001,9001,0,...,N,800000,20111,0,0,0,0,O,U,580000
1,2,0,1,0,0,0,24001,0,24001,0,...,N,500000,20143,0,0,0,0,O,U,90000
2,3,0,0,1,3,2,15001,9001,0,3001,...,Y,500000,20103,0,0,0,0,O,U,120000
3,4,1,0,2,4,2,6001,3001,0,3001,...,N,900000,20144,0,540000,0,630000,G,S,320000
4,5,0,4,0,0,0,21001,15001,21001,0,...,Y,800000,20131,0,130000,0,90000,G,U,410000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
100228,102248,0,1,0,2,2,75001,15001,57001,0,...,N,0,20111,0,20000,0,0,R,U,0
100229,102249,0,2,0,0,0,54001,9001,54001,0,...,Y,900000,20134,0,0,0,0,K,U,180000
100230,102250,0,1,0,0,0,27001,27001,27001,0,...,N,0,20141,0,0,0,0,O,U,0
100231,102251,0,0,0,1,1,57001,0,0,0,...,N,900000,20103,0,0,0,0,O,U,540000
100232,102252,0,1,0,0,0,18001,18001,18001,0,...,N,400000,20151,0,0,0,60000,K,U,180000

In [40]:
df_drop = df.drop([0, 2])
df_drop

,CUST_ID,TARGET,BNK_LNIF_CNT,CPT_LNIF_CNT,SPART_LNIF_CNT,ECT_LNIF_CNT,TOT_LNIF_AMT,TOT_CLIF_AMT,BNK_LNIF_AMT,CPT_LNIF_AMT,...,CBPT_MBSP_YN,MOBL_FATY_PRC,TEL_CNTT_QTR,NUM_DAY_SUSP,CRMM_OVDU_AMT,TLFE_UNPD_CNT,LT1Y_MXOD_AMT,PAYM_METD,LINE_STUS,MOBL_PRIN
1,2,0,1,0,0,0,24001,0,24001,0,...,N,500000,20143,0,0,0,0,O,U,90000
3,4,1,0,2,4,2,6001,3001,0,3001,...,N,900000,20144,0,540000,0,630000,G,S,320000
4,5,0,4,0,0,0,21001,15001,21001,0,...,Y,800000,20131,0,130000,0,90000,G,U,410000
5,6,0,1,0,1,1,141001,27001,111001,0,...,N,400000,20154,0,0,0,0,O,U,170000
6,7,0,0,1,2,1,12001,3001,0,9001,...,N,900000,20143,0,120000,0,290000,G,U,720000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
100228,102248,0,1,0,2,2,75001,15001,57001,0,...,N,0,20111,0,20000,0,0,R,U,0
100229,102249,0,2,0,0,0,54001,9001,54001,0,...,Y,900000,20134,0,0,0,0,K,U,180000
100230,102250,0,1,0,0,0,27001,27001,27001,0,...,N,0,20141,0,0,0,0,O,U,0
100231,102251,0,0,0,1,1,57001,0,0,0,...,N,900000,20103,0,0,0,0,O,U,540000
100232,102252,0,1,0,0,0,18001,18001,18001,0,...,N,400000,20151,0,0,0,60000,K,U,180000

In [43]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df1 = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])
df1.head()

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [45]:
df1.drop(['John', 'Nate'])
df1

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [50]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df1 = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])
df1.drop(['John', 'Nate'], inplace = True)
df1

       age        job
Jenny   30  developer

In [52]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df1 = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])
df2 = df1.drop(df1.index[[0,2]])
df2

       age        job
Jenny   30  developer

# Drop column

In [55]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df1 = pd.DataFrame(friend_dict_list)
df1

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [58]:
df1['salary'] = 0
df1

    name  age        job  salary
0   Jone   20    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [62]:
#numpy -> 실제 Pandas 는 numpy 위에 만들어진 도구
#pandas 설치시 자동으로 같이 설치됨
#np.where -> excel 의 if 문과 유사

import numpy as np
df1['salary'] = np.where(df1['job'] != 'student' , 'yes', 'no') 
df1

    name  age        job salary
0   Jone   20    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [64]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df1 = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df1

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [70]:
df1['total'] = df1['midterm'] + df1['final']
df1['average'] = (df1['midterm'] + df1['final']) / 2

df1

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

In [75]:
grades = []

for row in df1['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('F')
        
df1['grade'] = grades
df1

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

In [79]:
#function 을 사용한 방법
#apply

def pass_or_fail(row):
    #print(row)
    if row != "F":
        return 'Pass'
    else:
        return 'Fail'

df1["pass"] = df1.grade.apply(pass_or_fail)
df1

    name  midterm  final  total  average grade  pass
0   John       95     85    180     90.0     A  Pass
1  Jenny       85     80    165     82.5     B  Pass
2   Nate       10     30     40     20.0     F  Fail

In [61]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df1 = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df1

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [64]:
def extract_year(row):
    #return row.split('-')[0]
    return int(row[0:4])

df1['year'] = df1['yyyy-mm-dd'].apply(extract_year)
df1

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [65]:
def extract_year(year, current_year):
    return current_year - int(year)

df1['age'] = df1['year'].apply(extract_year, current_year=2020)
df1

   yyyy-mm-dd  year  age
0  2000-06-27  2000   20
1  2002-09-24  2002   18
2  2005-12-20  2005   15

In [10]:
#df 에 apply --> row 단위 혹은 Column 단위로 넘어간다.

def printaxis(row) :
    for x in row :
        print(x)

df1.apply(printaxis, axis=0)
print("-----------")
df1.apply(printaxis, axis=1)

2000-06-27
2002-09-24
2005-12-20
2000
2002
2005
20
18
15
-----------
2000-06-27
2000
20
2002-09-24
2002
18
2005-12-20
2005
15

0    None
1    None
2    None
dtype: object

In [78]:
# 여러 Column 값을 활용해서 값으 계산할때
def get_introduce2(row):
    return "I was born in "+str(row.year)+" my age is "+str(row.age)

df1["introduce"] = df1.apply(get_introduce2, axis=1)
df1

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   20  I was born in 2000 my age is 20
1  2002-09-24  2002   18  I was born in 2002 my age is 18
2  2005-12-20  2005   15  I was born in 2005 my age is 15

In [16]:
#하나의 Column 만 활용해서 값을 변환
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

def extract_year(row):
    return row.split('-')[0]

df['year'] = df['yyyy-mm-dd'].map(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005



**apply함수**<br>

커스텀 함수를 사용하기 위해 DataFrame에서 복수 개의 컬럼이 필요하다면, apply함수를 사용해야 한다. 


**map함수**<br>

map함수는 DataFrame 타입이 아니라, 반드시 Series 타입에서만 사용해야 한다.


**applymap함수**<br>

DataFrame 에 적용하며, 모든 값이 해당 함수를 적용받는다.

In [19]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [20]:
df.job = df.job.map({"student":1,"developer":2,"teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

In [21]:
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [23]:
import numpy as np
df = df.applymap(np.around)
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

# Group By

In [2]:

# Importing common libraries

import numpy as np
import pandas as pd

# sample DataFrame
df = pd.DataFrame({'group': ['grpa', 'grpa', 'grpa', 'grpb', 'grpb', 'grpb'], 
                  'value_1': np.arange(6), 
                 'value_2': np.random.randn(6)})

df

  group  value_1   value_2
0  grpa        0 -0.337860
1  grpa        1 -0.061224
2  grpa        2 -0.088279
3  grpb        3  0.329610
4  grpb        4  0.158617
5  grpb        5  1.197707

In [12]:
grouped = df.groupby('group')
grouped

In [13]:
grouped.count()

       value_1  value_2
group
grpa         3        3
grpb         3        3

In [14]:
grouped.sum()

       value_1   value_2
group
grpa         3 -0.487363
grpb        12  1.685933

In [11]:
grouped1 = df.groupby('group', as_index=False)
grouped1.sum()

  group  value_1   value_2
0  grpa        3 -0.487363
1  grpb       12  1.685933

In [44]:
pd.DataFrame({"count" : grouped.count()['value_2']}) # DataFrame

       count
group
grpa       3
grpb       3

In [30]:
grouped.sum()

       value_1   value_2
group
grpa         3 -0.781858
grpb        12  1.394314

In [31]:
grouped.min()

       value_1   value_2
group
grpa         0 -1.298272
grpb         3 -0.147728

In [32]:
grouped.max()

       value_1   value_2
group
grpa         2  0.390226
grpb         5  0.886899

In [35]:
grouped.mean() #평균값

       value_1   value_2
group
grpa         1 -0.260619
grpb         4  0.464771

In [36]:
grouped.median() #중위값

       value_1   value_2
group
grpa         1  0.126189
grpb         4  0.655143

In [38]:
grouped.std() #표준편차

       value_1   value_2
group
grpa       1.0  0.908279
grpb       1.0  0.542950

In [39]:
grouped.var() #분산

       value_1   value_2
group
grpa         1  0.824972
grpb         1  0.294795

In [40]:
grouped.describe()

      value_1                                    value_2                      \
        count mean  std  min  25%  50%  75%  max   count      mean       std
group
grpa      3.0  1.0  1.0  0.0  0.5  1.0  1.5  2.0     3.0 -0.260619  0.908279
grpb      3.0  4.0  1.0  3.0  3.5  4.0  4.5  5.0     3.0  0.464771  0.542950


            min       25%       50%       75%       max
group
grpa  -1.298272 -0.586042  0.126189  0.258207  0.390226
grpb  -0.147728  0.253707  0.655143  0.771021  0.886899

In [42]:
grouped.describe().T

group              grpa      grpb
value_1 count  3.000000  3.000000
        mean   1.000000  4.000000
        std    1.000000  1.000000
        min    0.000000  3.000000
        25%    0.500000  3.500000
        50%    1.000000  4.000000
        75%    1.500000  4.500000
        max    2.000000  5.000000
value_2 count  3.000000  3.000000
        mean  -0.260619  0.464771
        std    0.908279  0.542950
        min   -1.298272 -0.147728
        25%   -0.586042  0.253707
        50%    0.126189  0.655143
        75%    0.258207  0.771021
        max    0.390226  0.886899

<h1><p style="color:red">Homework</p></h1>

## 본인이 현재 하는 업무와 연관된 Excel 하나를 반출 
## 반출시 개인정보는 삭제 (계좌번호, 이름 등등), 빅식별화 수행
## 건수를 1,000 건정도로 한정
## 반출된 자료를 기반으로 오늘 배운 내용을 전부 수행

# Concatenation & merge

In [26]:
import pandas as pd
dataflair={
    'item no.':[1,2,3,4,5],
    'category':['채소','채소','과일','채소','과일'],
    'name':['당근','콩','사과','감자','포도']
}
data1=pd.DataFrame(dataflair,columns=['item no.','category','name'])
data1

   item no. category name
0         1       채소   당근
1         2       채소    콩
2         3       과일   사과
3         4       채소   감자
4         5       과일   포도

In [24]:
dataflair2={
    'item no.':[4,5,6,7,8],
    'category':['채소','과일','과일','채소','과일'],
    'name':['호박','망고','배','배추','수박']
}
data2=pd.DataFrame(dataflair2,columns=['item no.','category','name'])
data2

   item no. category name
0         4       채소   호박
1         5       과일   망고
2         6       과일    배
3         7       채소   배추
4         8       과일   수박

In [14]:
dataflair3={
    'item no.':[1,2,3,4,5,6,7,8,9,10],
    'price':[12,23,98,15,88,24,67,58,26,96]
}
data3=pd.DataFrame(dataflair3,columns=['item no.','price'])
data3

   item no.  price
0         1     12
1         2     23
2         3     98
3         4     15
4         5     88
5         6     24
6         7     67
7         8     58
8         9     26
9        10     96

In [19]:
data_all=pd.concat([data1,data2])
data_all

   item no. category name
0         1       채소   당근
1         2       채소    콩
2         3       과일   사과
3         4       과일   감자
4         5       과일   포도
0         4       채소   호박
1         5       과일   망고
2         6       과일    배
3         7       채소   배추
4         8       과일   수박

In [20]:
pd.concat([data1,data2], axis=1)

   item no. category name  item no. category name
0         1       채소   당근         4       채소   호박
1         2       채소    콩         5       과일   망고
2         3       과일   사과         6       과일    배
3         4       과일   감자         7       채소   배추
4         5       과일   포도         8       과일   수박

In [21]:
pd.merge(data_all, data3, on='item no.')

   item no. category name  price
0         1       채소   당근     12
1         2       채소    콩     23
2         3       과일   사과     98
3         4       과일   감자     15
4         4       채소   호박     15
5         5       과일   포도     88
6         5       과일   망고     88
7         6       과일    배     24
8         7       채소   배추     67
9         8       과일   수박     58

In [27]:
 pd.merge(data1,data2,on=['item no.','category'])

   item no. category name_x name_y
0         4       채소     감자     호박
1         5       과일     포도     망고

In [29]:
pd.merge(data1,data2, on='item no.', how='outer')

   item no. category_x name_x category_y name_y
0         1         채소     당근        NaN    NaN
1         2         채소      콩        NaN    NaN
2         3         과일     사과        NaN    NaN
3         4         채소     감자         채소     호박
4         5         과일     포도         과일     망고
5         6        NaN    NaN         과일      배
6         7        NaN    NaN         채소     배추
7         8        NaN    NaN         과일     수박

In [30]:
pd.merge(data1,data2, on='item no.', how='inner')

   item no. category_x name_x category_y name_y
0         4         채소     감자         채소     호박
1         5         과일     포도         과일     망고

In [31]:
pd.merge(data1,data2, on='item no.', how='right')

   item no. category_x name_x category_y name_y
0         4         채소     감자         채소     호박
1         5         과일     포도         과일     망고
2         6        NaN    NaN         과일      배
3         7        NaN    NaN         채소     배추
4         8        NaN    NaN         과일     수박

In [32]:
pd.merge(data1,data2, on='item no.', how='left')

   item no. category_x name_x category_y name_y
0         1         채소     당근        NaN    NaN
1         2         채소      콩        NaN    NaN
2         3         과일     사과        NaN    NaN
3         4         채소     감자         채소     호박
4         5         과일     포도         과일     망고

# Drop Duplicate

In [33]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [34]:
# check if there is duplicated row
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [35]:
df = df.drop_duplicates()
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [36]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [37]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [42]:
df1 = df.drop_duplicates(['name'], keep='last')
df1

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

# how to manage None value?

In [54]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [44]:
# how to check if there is Null or NaN
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 192.0+ bytes

In [45]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [46]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [47]:
tmp = df
tmp["age"] = tmp["age"].fillna(0)
tmp

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [56]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])

df["age"].fillna(df.groupby("job")["age"].transform("median"), inplace=True)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

In [57]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

In [58]:
#df["job"].unique()
df.job.unique()

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [60]:
#df["job"].value_counts()
df.job.value_counts()

teacher              8
student              5
lawyer               2
banker               2
dentist              1
basketball player    1
developer            1
Name: job, dtype: int64

In [82]:
df.sort_values(by=['name', 'job'])

       name                job
3   Abraham            student
4     Brian            student
10    Brian            student
15    Chris             banker
13   Edward            teacher
2      Fred            teacher
18     Gwen            teacher
14      Ian            teacher
17    Janny  basketball player
5     Janny          developer
19    Jessy            student
0      John            teacher
11     Matt            student
1      Nate            teacher
6      Nate            teacher
7    Obrian            dentist
16   Philip             lawyer
9       Rob             lawyer
12    Wendy             banker
8      Yuna            teacher